//-----------------------------------------------------------------------------
// Description: Функция проверяет наличее обновления
//              due to change in the program version number
// Parameters: None
// Возврат value: Истина if no conversion was processed or database conversion 
//               routines processed successfully, Ложь if error occurred during
//               conversion
//-----------------------------------------------------------------------------
Функция глОбновлениеБазы(парФрмРазмИзм = Неопределено) Экспорт
	слПервЗапуск = ПустаяСтрока(Константы.НомерРелиза.Получить());
	Если НЕ слПервЗапуск И СокрЛП(Константы.НомерРелиза.Получить()) <> СокрЛП(метаданные.Версия) Тогда
		
		Предупреждение("Изменился НомерРазмещения релиза конфигурации. Будет выполнено обновление информационной базы.", 5);

		слФрм = Обработки.ОбновлениеБД.ПолучитьФорму();
		слРез = слФрм.ОткрытьМодально();
		Если слРез <> Истина Тогда
			Возврат Ложь;
		КонецЕсли; 
	Иначе
		// установка тек версии
		Если СокрЛП(Константы.НомерРелиза.Получить()) <> СокрЛП(Метаданные.Версия) Тогда
			Константы.НомерРелиза.Установить(Метаданные.Версия);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;

	// Check user rights for info base update
	Если НЕ ПравоДоступа("Использование", Метаданные.Обработки.ОбновлениеБД) ИЛИ
	   НЕ ПравоДоступа("Просмотр", Метаданные.Обработки.ОбновлениеБД) Тогда
		Предупреждение("Недостаточно прав для выполнения обновления! Работа программы будет завершена.", 5);
		Возврат Ложь;
	КонецЕсли;

	// Do info base update
	Если НЕ Обработки.ОбновлениеБД.Создать().парМодБазаОбн(парФрмРазмИзм) Тогда
		Предупреждение("В процессе обновления информационной базы были ошибки! Проверьте журнал регистрации.", 5);
	КонецЕсли;

	// Check info base update status
	Если СокрЛП(Константы.НомерРелиза.Получить()) <> СокрЛП(Метаданные.Версия) Тогда
		vMessage = "Не выполнено обновление информационной базы! Продолжить работу программы?";
		vReply = DoQueryBox(vMessage, QuestionDialogMode.YesNo, 20, DialogReturnCode.Yes);
		Возврат (vReply = DialogReturnCode.Yes);
	КонецЕсли;

	Возврат Истина;
EndFunction //глОбновлениеБазы

//-----------------------------------------------------------------------------
// Description: Function shows program license agreement
// Parameters: None
// Возврат value: Ложь if user declined the agreement, Истина otherwise
//-----------------------------------------------------------------------------
